export const crosscheckDescription = `Total score 300/300

Если у вас есть вопросы или вы считаете, что какой-то пункт не выполнен, просим отписать об этом дискорд, будем рады с вами пообщаться.

1.Главная страница
    - присутствуют и работают два блока фильтров типа checkbox +10
    - присутствуют и работают два блока фильтров типа dual-slider +10
    - изменение любых фильтров добавляет в query-параметры соответствующие данные +10
    - при применении любого фильтра, должны динамически пересчитываться все фильтры и меняться состояние элементов в них +10
    - сортировка по 2м критериям +10
    - данные сортировки отображаются в адресной строке, при открытии ссылки в НОВОМ окне сортировка применяется +10
    - реализован тескстовый поиск, который работает с другими фильтрами и добавляется в query-параметры +15
    - реализована возможность переключения вида найденных товаров, добавляется в query-параметры + 10
    - реализован роутинг с query-параметрами +10
    - реализованы кнопки сброса и копирования поиска +10
    - реализован блок кол-ва найденных товаров +5
    - Поведение карточек найденных товаров согласно ТЗ +10

2. Страница корзины товаров
    - реализован блок отображения добавленных продуктов +5
    - реализовано увеличение кол-ва конкретного товара и его удаление +10
    - реализована пагинация +15
    - хранение данных в localStorage +10
    - реализован промокод блок +10
    - Реализована кнопка открытия модального окна оформления покупки + 5
    - Реализован блок с общей суммой и кол-вом всех выбранных товаров +5

3. Страница 404
    - страница существует +6
    - страница не реагирует на некорректные query-параметры +4

4. Header
    - header содержит корзину товаров +10
    - header содержит общую сумму покупок +10

5. Страница с описанием товара
    - страница реализована и соответствует ТЗ +40

6. Модальное окно оформления товара
    - окно сущетсвует, функционал реализован согдласно ТЗ +50
`;
